; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l15-c8)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 
          c0 c1 c2 c3 c4 c5 c6 c7 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(location l5)
(location l6)
(location l7)
(location l8)
(location l9)
(location l10)
(location l11)
(location l12)
(location l13)
(location l14)
(car c0)
(car c1)
(car c2)
(car c3)
(car c4)
(car c5)
(car c6)
(car c7)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l0 l5)
(not-eq l5 l0)
(not-eq l0 l6)
(not-eq l6 l0)
(not-eq l0 l7)
(not-eq l7 l0)
(not-eq l0 l8)
(not-eq l8 l0)
(not-eq l0 l9)
(not-eq l9 l0)
(not-eq l0 l10)
(not-eq l10 l0)
(not-eq l0 l11)
(not-eq l11 l0)
(not-eq l0 l12)
(not-eq l12 l0)
(not-eq l0 l13)
(not-eq l13 l0)
(not-eq l0 l14)
(not-eq l14 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l1 l5)
(not-eq l5 l1)
(not-eq l1 l6)
(not-eq l6 l1)
(not-eq l1 l7)
(not-eq l7 l1)
(not-eq l1 l8)
(not-eq l8 l1)
(not-eq l1 l9)
(not-eq l9 l1)
(not-eq l1 l10)
(not-eq l10 l1)
(not-eq l1 l11)
(not-eq l11 l1)
(not-eq l1 l12)
(not-eq l12 l1)
(not-eq l1 l13)
(not-eq l13 l1)
(not-eq l1 l14)
(not-eq l14 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l2 l5)
(not-eq l5 l2)
(not-eq l2 l6)
(not-eq l6 l2)
(not-eq l2 l7)
(not-eq l7 l2)
(not-eq l2 l8)
(not-eq l8 l2)
(not-eq l2 l9)
(not-eq l9 l2)
(not-eq l2 l10)
(not-eq l10 l2)
(not-eq l2 l11)
(not-eq l11 l2)
(not-eq l2 l12)
(not-eq l12 l2)
(not-eq l2 l13)
(not-eq l13 l2)
(not-eq l2 l14)
(not-eq l14 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(not-eq l3 l5)
(not-eq l5 l3)
(not-eq l3 l6)
(not-eq l6 l3)
(not-eq l3 l7)
(not-eq l7 l3)
(not-eq l3 l8)
(not-eq l8 l3)
(not-eq l3 l9)
(not-eq l9 l3)
(not-eq l3 l10)
(not-eq l10 l3)
(not-eq l3 l11)
(not-eq l11 l3)
(not-eq l3 l12)
(not-eq l12 l3)
(not-eq l3 l13)
(not-eq l13 l3)
(not-eq l3 l14)
(not-eq l14 l3)
(not-eq l4 l5)
(not-eq l5 l4)
(not-eq l4 l6)
(not-eq l6 l4)
(not-eq l4 l7)
(not-eq l7 l4)
(not-eq l4 l8)
(not-eq l8 l4)
(not-eq l4 l9)
(not-eq l9 l4)
(not-eq l4 l10)
(not-eq l10 l4)
(not-eq l4 l11)
(not-eq l11 l4)
(not-eq l4 l12)
(not-eq l12 l4)
(not-eq l4 l13)
(not-eq l13 l4)
(not-eq l4 l14)
(not-eq l14 l4)
(not-eq l5 l6)
(not-eq l6 l5)
(not-eq l5 l7)
(not-eq l7 l5)
(not-eq l5 l8)
(not-eq l8 l5)
(not-eq l5 l9)
(not-eq l9 l5)
(not-eq l5 l10)
(not-eq l10 l5)
(not-eq l5 l11)
(not-eq l11 l5)
(not-eq l5 l12)
(not-eq l12 l5)
(not-eq l5 l13)
(not-eq l13 l5)
(not-eq l5 l14)
(not-eq l14 l5)
(not-eq l6 l7)
(not-eq l7 l6)
(not-eq l6 l8)
(not-eq l8 l6)
(not-eq l6 l9)
(not-eq l9 l6)
(not-eq l6 l10)
(not-eq l10 l6)
(not-eq l6 l11)
(not-eq l11 l6)
(not-eq l6 l12)
(not-eq l12 l6)
(not-eq l6 l13)
(not-eq l13 l6)
(not-eq l6 l14)
(not-eq l14 l6)
(not-eq l7 l8)
(not-eq l8 l7)
(not-eq l7 l9)
(not-eq l9 l7)
(not-eq l7 l10)
(not-eq l10 l7)
(not-eq l7 l11)
(not-eq l11 l7)
(not-eq l7 l12)
(not-eq l12 l7)
(not-eq l7 l13)
(not-eq l13 l7)
(not-eq l7 l14)
(not-eq l14 l7)
(not-eq l8 l9)
(not-eq l9 l8)
(not-eq l8 l10)
(not-eq l10 l8)
(not-eq l8 l11)
(not-eq l11 l8)
(not-eq l8 l12)
(not-eq l12 l8)
(not-eq l8 l13)
(not-eq l13 l8)
(not-eq l8 l14)
(not-eq l14 l8)
(not-eq l9 l10)
(not-eq l10 l9)
(not-eq l9 l11)
(not-eq l11 l9)
(not-eq l9 l12)
(not-eq l12 l9)
(not-eq l9 l13)
(not-eq l13 l9)
(not-eq l9 l14)
(not-eq l14 l9)
(not-eq l10 l11)
(not-eq l11 l10)
(not-eq l10 l12)
(not-eq l12 l10)
(not-eq l10 l13)
(not-eq l13 l10)
(not-eq l10 l14)
(not-eq l14 l10)
(not-eq l11 l12)
(not-eq l12 l11)
(not-eq l11 l13)
(not-eq l13 l11)
(not-eq l11 l14)
(not-eq l14 l11)
(not-eq l12 l13)
(not-eq l13 l12)
(not-eq l12 l14)
(not-eq l14 l12)
(not-eq l13 l14)
(not-eq l14 l13)
(empty-ferry)
(at c0 l2)
(at c1 l3)
(at c2 l5)
(at c3 l9)
(at c4 l12)
(at c5 l13)
(at c6 l3)
(at c7 l11)
(at-ferry l9)
)
(:goal
(and
(at c0 l8)
(at c1 l8)
(at c2 l1)
(at c3 l7)
(at c4 l12)
(at c5 l13)
(at c6 l12)
(at c7 l13)
)
)
)

; plan
1. (board c3 l9)
   deleted: (at c3 l9) (empty-ferry)
   added: (on c3)
   goals met: 2 of 8
2. (sail l9 l8)
   deleted: (at-ferry l9)
   added: (at-ferry l8)
   goals met: 2 of 8
3. (sail l8 l7)
   deleted: (at-ferry l8)
   added: (at-ferry l7)
   goals met: 2 of 8
4. (debark c3 l7)
   deleted: (on c3)
   added: (at c3 l7) (empty-ferry)
   goals met: 3 of 8
5. (sail l7 l8)
   deleted: (at-ferry l7)
   added: (at-ferry l8)
   goals met: 3 of 8
6. (sail l8 l5)
   deleted: (at-ferry l8)
   added: (at-ferry l5)
   goals met: 3 of 8
7. (board c2 l5)
   deleted: (at c2 l5) (empty-ferry)
   added: (on c2)
   goals met: 3 of 8
8. (sail l5 l8)
   deleted: (at-ferry l5)
   added: (at-ferry l8)
   goals met: 3 of 8
9. (sail l8 l1)
   deleted: (at-ferry l8)
   added: (at-ferry l1)
   goals met: 3 of 8
10. (debark c2 l1)
   deleted: (on c2)
   added: (at c2 l1) (empty-ferry)
   goals met: 4 of 8
11. (sail l1 l8)
   deleted: (at-ferry l1)
   added: (at-ferry l8)
   goals met: 4 of 8
12. (sail l8 l3)
   deleted: (at-ferry l8)
   added: (at-ferry l3)
   goals met: 4 of 8
13. (board c6 l3)
   deleted: (at c6 l3) (empty-ferry)
   added: (on c6)
   goals met: 4 of 8
14. (sail l3 l12)
   deleted: (at-ferry l3)
   added: (at-ferry l12)
   goals met: 4 of 8
15. (debark c6 l12)
   deleted: (on c6)
   added: (at c6 l12) (empty-ferry)
   goals met: 5 of 8
16. (sail l12 l8)
   deleted: (at-ferry l12)
   added: (at-ferry l8)
   goals met: 5 of 8
17. (sail l8 l3)
   deleted: (at-ferry l8)
   added: (at-ferry l3)
   goals met: 5 of 8
18. (board c1 l3)
   deleted: (at c1 l3) (empty-ferry)
   added: (on c1)
   goals met: 5 of 8
19. (sail l3 l8)
   deleted: (at-ferry l3)
   added: (at-ferry l8)
   goals met: 5 of 8
20. (debark c1 l8)
   deleted: (on c1)
   added: (at c1 l8) (empty-ferry)
   goals met: 6 of 8
21. (sail l8 l2)
   deleted: (at-ferry l8)
   added: (at-ferry l2)
   goals met: 6 of 8
22. (board c0 l2)
   deleted: (at c0 l2) (empty-ferry)
   added: (on c0)
   goals met: 6 of 8
23. (sail l2 l8)
   deleted: (at-ferry l2)
   added: (at-ferry l8)
   goals met: 6 of 8
24. (debark c0 l8)
   deleted: (on c0)
   added: (at c0 l8) (empty-ferry)
   goals met: 7 of 8
25. (sail l8 l13)
   deleted: (at-ferry l8)
   added: (at-ferry l13)
   goals met: 7 of 8
26. (sail l13 l11)
   deleted: (at-ferry l13)
   added: (at-ferry l11)
   goals met: 7 of 8
27. (board c7 l11)
   deleted: (at c7 l11) (empty-ferry)
   added: (on c7)
   goals met: 7 of 8
28. (sail l11 l13)
   deleted: (at-ferry l11)
   added: (at-ferry l13)
   goals met: 7 of 8
29. (debark c7 l13)
   deleted: (on c7)
   added: (at c7 l13) (empty-ferry)
   goals met: 8 of 8
